import billboard

#Listagem de apenas 4 categorias

print("********************************************************")
print("")
print("Escolha a categoria que deseja")
print("1. The Hot 100 Chart")
print("2. Billboard 200")
print("3. Billboard Artist 100 Chart")
print("4. Social 50 Chart")
print("********************************************************")
opcao = int(input("Opção número: "))
#print(billboard.charts())
print("*******************************************************")
#print(chart)

opcoes_validas = [1,2,3,4]


if opcao not in opcoes_validas:
    print("Opção inválida!")
    print("Saindo!")
    exit()

elif opcao == 1:
    chart=billboard.ChartData('hot-100')
    print("==================================================================================================")
    print("Música                                                                    Artista                 ")
    print("==================================================================================================")
 
    for x in range(100):
        crt = chart[x]
        print("==============================================================================================")
       # print("..............................................................................................")
       # print(str(x+1)+". "+crt.title+"                                              "+crt.artist               )
        print(str(x+1)+". "+crt.title+" ~~~~~~~~~~~~~~~~~~~~~~ "+crt.artist )


elif opcao == 2:
    chart=billboard.ChartData('billboard-200')
    print("==================================================================================================")
    print("Música                                                                    Artista                 ")
    print("==================================================================================================")
 
    for x in range(200):
        crt = chart[x]
        print("..............................................................................................")
        print(str(x+1)+". "+crt.title+"                                            "+crt.artist              )

elif opcao == 3:
    chart=billboard.ChartData('artist-100')
    print("==================================================================================================")
    print("Música                                                                    Artista                 ")
    print("==================================================================================================")
    
    for x in range(100):
        crt = chart[x]
        print("...............................................................................................")
        print(str(x+1)+". "+crt.artist)
else:
    chart=billboard.ChartData('social-50')
    print("==================================================================================================")
    print("Música                                                                    Artista                 ")
    print("==================================================================================================")
    
    for x in range(50):
        crt = chart[x]   
        print("..............................................................................................")
        print(str(x+1)+". "+crt.artist)
